it/FreeBSD/thinjails.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../style.css" />

#+begin_export html
<div class="lang">
<li><a href="../../en/FreeBSD/thinjails.html">en</a>&nbsp;</li>
<li> | <a href="FreeBSD/thinjails.html">it</a></li>
</div>
#+end_export

#+begin_export html
<nav class="crumbs">
  <ol>
    <li class="crumb"><a href="../index.html">Home</a></li>
    <li class="crumb">Creare cloni jail da snapshot OpenZFS</li>
  </ol>
</nav>
#+end_export


#+TITLE: Creare cloni jail da snapshot OpenZFS
#+OPTIONS: title:nil
#+AUTHOR: https://vieron.info
# Disable super/subscripting 
#+OPTIONS: ^:nil

#+OPTIONS: toc:nil

@@html:<h1 style="text-align: center;">@@Creare cloni jail da snapshot OpenZFS@@html:</h1>@@
@@html:<h3 style="text-align: center;">@@ATTENZIONE: i seguenti sono miei appunti personali. Usateli a vostro rischio e pericolo!@@html:</h3>@@



* Creare una "Thin Jail" tramite snapshot OpenZFS

#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots</a></p>
#+end_export

Abilitare lo start automatico di tutte le jail configurate all'avvio del sistema:
#+begin_example
# sysrc jail_enable="YES"
# sysrc jail_parallel_start="YES"
#+end_example


Creare dataset per le directory che ospiteranno le jail:
#+begin_example
# zfs create -o mountpoint=/usr/local/jails zroot/jails
# zfs create zroot/jails/media
# zfs create zroot/jails/templates
# zfs create zroot/jails/containers
#+end_example

** Creare una "template jail" tramite snapshot ZFS

Scaricare e aggiornare la "base", poi creare la snapshot che verrà utilizzata per i futuri cloni:
#+begin_example
# fetch https://download.freebsd.org/ftp/releases/amd64/amd64/13.2-RELEASE/base.txz -o /usr/local/jails/media/13.2-RELEASE-base.txz
# tar -xf /usr/local/jails/media/13.2-RELEASE-base.txz -C /usr/local/jails/templates/13.2-RELEASE --unlink
# freebsd-update -b /usr/local/jails/templates/13.2-RELEASE/ fetch install
# zfs snapshot zroot/jails/templates/13.2-RELEASE@base
#+end_example

** Creare la nuova jail (clone ZFS) da template
Creare il clone dalla snapshot
#+begin_example
# zfs clone zroot/jails/templates/13.2-RELEASE@base zroot/jails/containers/thinjail
#+end_example

Copiare file di configurazione essenziali (OPTIONAL)
#+begin_example
# cp /etc/resolv.conf /usr/local/jails/containers/thinjail/etc/resolv.conf
# cp /etc/localtime /usr/local/jails/containers/thinjail/etc/localtime
#+end_example

Creare un file di configurazione per la nuova jail sotto /etc/jail.conf.d:
#+begin_example
# ls /etc/jail.conf.d/
thinjail.conf
#+end_example

Startare la jail:
#+begin_example
# service jail start thinjail
#+end_example

* Fare l'upgrade della jail

#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading</a></p>
#+end_export

Aggiornare la jail alla patch più recente:
#+begin_example
# freebsd-update -j thinjail fetch install
# service jail restart thinjail
#+end_example

Aggiornare la jail alla nuova major o minor release:

1. Per prima cosa fare l'upgrade e poi riavviare l'Host

2. poi aggiornare la jail:
#+begin_example
# freebsd-update -j thinjail -r 13.2-RELEASE upgrade
# freebsd-update -j thinjail install
# service jail restart thinjail
# freebsd-update -j thinjail install
# service jail restart thinjail
#+end_example

#+TOC: headlines N

#+begin_export html
<hr>
#+end_export
