it/FreeBSD/thinjails.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-02 Fri 17:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creare cloni jail da snapshot OpenZFS</title>
<meta name="author" content="https://vieron.info" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="content" class="content">
<div class="lang">
<li><a href="../../en/FreeBSD/thinjails.html">en</a>&nbsp;</li>
<li> | <a href="FreeBSD/thinjails.html">it</a></li>
</div>

<nav class="crumbs">
  <ol>
    <li class="crumb"><a href="../index.html">Home</a></li>
    <li class="crumb">Creare cloni jail da snapshot OpenZFS</li>
  </ol>
</nav>


<p>
<h1 style="text-align: center;">Creare cloni jail da snapshot OpenZFS</h1>
<h3 style="text-align: center;">ATTENZIONE: i seguenti sono miei appunti personali. Usateli a vostro rischio e pericolo!</h3>
</p>
<div id="outline-container-org5a73ec4" class="outline-2">
<h2 id="org5a73ec4"><span class="section-number-2">1.</span> Creare una "Thin Jail" tramite snapshot OpenZFS</h2>
<div class="outline-text-2" id="text-1">
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots</a></p>

<p>
Abilitare lo start automatico di tutte le jail configurate all'avvio del sistema:
</p>
<pre class="example" id="orgda3aa0e">
# sysrc jail_enable="YES"
# sysrc jail_parallel_start="YES"
</pre>


<p>
Creare dataset per le directory che ospiteranno le jail:
</p>
<pre class="example" id="orgb540554">
# zfs create -o mountpoint=/usr/local/jails zroot/jails
# zfs create zroot/jails/media
# zfs create zroot/jails/templates
# zfs create zroot/jails/containers
</pre>
</div>
<div id="outline-container-orge16d9dd" class="outline-3">
<h3 id="orge16d9dd"><span class="section-number-3">1.1.</span> Creare una "template jail" tramite snapshot ZFS</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Scaricare e aggiornare la "base", poi creare la snapshot che verrà utilizzata per i futuri cloni:
</p>
<pre class="example" id="org0e21aa6">
# fetch https://download.freebsd.org/ftp/releases/amd64/amd64/13.2-RELEASE/base.txz -o /usr/local/jails/media/13.2-RELEASE-base.txz
# tar -xf /usr/local/jails/media/13.2-RELEASE-base.txz -C /usr/local/jails/templates/13.2-RELEASE --unlink
# freebsd-update -b /usr/local/jails/templates/13.2-RELEASE/ fetch install
# zfs snapshot zroot/jails/templates/13.2-RELEASE@base
</pre>
</div>
</div>
<div id="outline-container-orgc81605e" class="outline-3">
<h3 id="orgc81605e"><span class="section-number-3">1.2.</span> Creare la nuova jail (clone ZFS) da template</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Creare il clone dalla snapshot
</p>
<pre class="example" id="org1e714c4">
# zfs clone zroot/jails/templates/13.2-RELEASE@base zroot/jails/containers/thinjail
</pre>

<p>
Copiare file di configurazione essenziali (OPTIONAL)
</p>
<pre class="example" id="org23cc927">
# cp /etc/resolv.conf /usr/local/jails/containers/thinjail/etc/resolv.conf
# cp /etc/localtime /usr/local/jails/containers/thinjail/etc/localtime
</pre>

<p>
Creare un file di configurazione per la nuova jail sotto /etc/jail.conf.d:
</p>
<pre class="example" id="org2cee2a8">
# ls /etc/jail.conf.d/
thinjail.conf
</pre>

<p>
Startare la jail:
</p>
<pre class="example" id="org268ca8c">
# service jail start thinjail
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5655b3" class="outline-2">
<h2 id="orgb5655b3"><span class="section-number-2">2.</span> Fare l'upgrade della jail</h2>
<div class="outline-text-2" id="text-2">
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading</a></p>

<p>
Aggiornare la jail alla patch più recente:
</p>
<pre class="example" id="org2278e2f">
# freebsd-update -j thinjail fetch install
# service jail restart thinjail
</pre>

<p>
Aggiornare la jail alla nuova major o minor release:
</p>

<ol class="org-ol">
<li>Per prima cosa fare l'upgrade e poi riavviare l'Host</li>

<li>poi aggiornare la jail:</li>
</ol>
<pre class="example" id="orga94dc82">
# freebsd-update -j thinjail -r 13.2-RELEASE upgrade
# freebsd-update -j thinjail install
# service jail restart thinjail
# freebsd-update -j thinjail install
# service jail restart thinjail
</pre>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5a73ec4">1. Creare una "Thin Jail" tramite snapshot OpenZFS</a>
<ul>
<li><a href="#orge16d9dd">1.1. Creare una "template jail" tramite snapshot ZFS</a></li>
<li><a href="#orgc81605e">1.2. Creare la nuova jail (clone ZFS) da template</a></li>
</ul>
</li>
<li><a href="#orgb5655b3">2. Fare l'upgrade della jail</a></li>
</ul>
</div>
</div>

<hr>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://vieron.info">https://vieron.info</a></p>
<p class="date">Created: 2025-05-02 Fri 17:31</p>
</div>
</body>
</html>
